# Основные сообщения
default_answer = 'Введите команду /start, чтобы начать общение.'
optional = 'Выберите опцию:'
information_text = '<b>Информация:</b>\nТестовое приложение для проверки возможностей бота.'

# Сообщения для регистрации
reg_text = '<b>Регистрация нового пользователя.</b>'
name_input = '<b>Регистрация:</b>\nВведите имя пользователя (только латинский алфавит):'
user_exist = 'Пользователь существует, введите другое имя.'
email_input = '<b>Регистрация:</b>\nВведите свой email:'
age_input = '<b>Регистрация:</b>\nВведите свой возраст:'
username_error = 'Некорректный ввод данных!\nВ имени пользователя должен использоваться только латинский алфавит.'
email_error = 'Некорректная электронная почта!\nВведите, пожалуйста, корректную.'
success_reg = '<b>Вы успешно зарегистрированы!</b>'

# Сообщения для покупки
buy_list = '<b>Список продукции для покупки:</b>'
choose_product = 'Выберите продукт для покупки: '
success_buy = 'Вы успешно приобрели '

# Сообщения для расчета калорий
formula_for_man = 'Формула расчета для мужчин:\n10 х вес (кг) + 6,25 x рост (см) – 5 х возраст (г) + 5'
formula_for_woman = 'Формула расчета для женщин:\n10 х вес (кг) + 6,25 x рост (см) – 5 х возраст (г) - 161'
gender_input = 'Выберите ваш пол:'
man_growth_input = 'Расчет нормы калорий для мужчин.\n<b>Введите свой рост:</b>'
man_weight_input = 'Расчет нормы калорий для мужчин.\n<b>Введите свой вес:</b>'
man_age_input = 'Расчет нормы калорий для мужчин.\n<b>Введите свой возраст:</b>'
woman_growth_input = 'Расчет нормы калорий для женщин.\n<b>Введите свой рост:</b>'
woman_weight_input = 'Расчет нормы калорий для женщин.\n<b>Введите свой вес:</b>'
woman_age_input = 'Расчет нормы калорий для женщин.\n<b>Введите свой возраст:</b>'

# Сообщения об ошибках
age_error = 'Некорректный ввод данных!\nВведите число для Вашего возраста.'
growth_error = 'Некорректный ввод данных!\nВведите число для Вашего роста.'
weight_error = 'Некорректный ввод данных!\nВведите число для Вашего веса.'

